{"config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "dtype": "float32", "name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "batch_input_shape": [null, 80, 80, 3], "activation": "relu", "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_size": [2, 2], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_size": [3, 3], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "units": 512, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "units": 256, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "units": 64, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_4", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_regularizer": null, "units": 1, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}